## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                NAME                 |
|--------|-------------------------------------|
| add    | `aws_iam_role.vpc_connection_role`  |
|        | `aws_quicksight_vpc_connection.rds` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.vpc_connection_role will be created
  + resource "aws_iam_role" "vpc_connection_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "quicksight.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "QuickSightVPCConnectionRolePolicy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "iam:GetRole",
                              + "iam:DetachRolePolicy",
                              + "iam:DeleteRole",
                              + "iam:AttachRolePolicy",
                              + "iam:CreateRole",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:iam::239043911459:role/service-role/aws-quicksight-service-role-v0",
                              + "arn:aws:iam::239043911459:role/service-role/aws-quicksight-s3-consumers-role-v0",
                            ]
                          + Sid      = "VisualEditor0"
                        },
                      + {
                          + Action   = [
                              + "iam:ListPolicies",
                              + "iam:GetPolicyVersion",
                              + "iam:GetRole",
                              + "iam:GetPolicy",
                              + "iam:ListPolicyVersions",
                              + "iam:ListAttachedRolePolicies",
                              + "iam:GenerateServiceLastAccessedDetails",
                              + "iam:ListEntitiesForPolicy",
                              + "iam:ListPoliciesGrantingServiceAccess",
                              + "iam:ListRoles",
                              + "iam:GetServiceLastAccessedDetails",
                              + "iam:ListAccountAliases",
                              + "iam:ListRolePolicies",
                              + "s3:ListAllMyBuckets",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "VisualEditor1"
                        },
                      + {
                          + Action   = [
                              + "iam:DeletePolicy",
                              + "iam:CreatePolicy",
                              + "iam:CreatePolicyVersion",
                              + "iam:DeletePolicyVersion",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightIAMPolicy",
                              + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightRDSPolicy",
                              + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightS3Policy",
                              + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightRedshiftPolicy",
                              + "arn:aws:iam::239043911459:policy/service-role/AWSQuickSightS3ConsumersPolicy",
                            ]
                          + Sid      = "VisualEditor2"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_quicksight_vpc_connection.rds will be created
  + resource "aws_quicksight_vpc_connection" "rds" {
      + arn                 = (known after apply)
      + availability_status = (known after apply)
      + aws_account_id      = (known after apply)
      + id                  = (known after apply)
      + name                = "Quicksight RDS connection"
      + role_arn            = (known after apply)
      + security_group_ids  = [
          + "sg-0c7f4c2a59629c052",
        ]
      + subnet_ids          = [
          + "subnet-001e585d12cce4d1e",
          + "subnet-08de34a9e1a7458dc",
          + "subnet-0af8b8402f1d605ff",
        ]
      + tags_all            = {}
      + vpc_connection_id   = "vpc-097508d1f5e243195"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
